tylertms/kinetis-k22-sim/tests/architecture/cortex_m4/system/reset_test.c
#include "kinetis.h"

#include <stdint.h>

#include "test.h"

int main(void) {
    TestState state = {0};
    KinetisConfiguration configuration = kinetis_configuration(KINETIS_PROFILE_MK22FN51212);
    configuration.flash_size = 4096;
    configuration.sram_size = 65536;
    Kinetis* device = kinetis_create(configuration);
    expect(&state, device != NULL, "device != NULL");
    const uint32_t vectors[2] = {0x20001000u, 0x00000101u};
    expect(&state, kinetis_load(device, 0, vectors, sizeof(vectors)),
           "kinetis_load(device, 0, vectors, sizeof(vectors))");
    expect(&state, kinetis_reset(device), "kinetis_reset(device)");
    CortexM4* cpu = kinetis_cpu(device);
    expect(&state, cortex_m4_get_register(cpu, 13) == 0x20001000u,
           "cortex_m4_get_register(cpu, 13) == 0x20001000u");
    expect(&state, cortex_m4_get_register(cpu, 14) == 0xffffffffu,
           "cortex_m4_get_register(cpu, 14) == 0xffffffffu");
    expect(&state, cortex_m4_get_register(cpu, 15) == 0x00000100u,
           "cortex_m4_get_register(cpu, 15) == 0x00000100u");
    expect(&state, cortex_m4_get_xpsr(cpu) == 0x01000000u,
           "cortex_m4_get_xpsr(cpu) == 0x01000000u");
    uint32_t ccr = 0;
    expect(&state, cortex_m4_read_memory(cpu, 0xe000ed14u, 4, &ccr),
           "cortex_m4_read_memory(cpu, 0xe000ed14u, 4, &ccr)");
    expect(&state, ccr == 0x00000200u, "ccr == 0x00000200u");
    expect(&state, cortex_m4_get_stop(cpu) == CORTEX_M4_STOP_RUNNING,
           "cortex_m4_get_stop(cpu) == CORTEX_M4_STOP_RUNNING");
    kinetis_destroy(device);
    return test_finish(&state);
}
